자 이번에는 CSS 프레임워크을 한번 적용을 해 보겠습니다
여기가 CSS 스타일링을 직접 해도 되지만 직접 스타일링 하는 것은 자유도는 높지만 좀 너무 저수준이에요
많은 걸 할 수 있지만 해야 될 게 많다는 거죠
그래서 다양한 CSS 프레임웍이 있습니다
그 중에 가장 대표적으로 Bootstrap 5이 있고요
Bootstrap은 현재 버전 5까지 나와 있습니다
Bootstrap의 css를 웹페이지에 포함시키는 것만으로 기본 스타일이 적용되고 Bootstrap에서 기본 정의한 클래스 명들을 이렇게 적용하시면요
이렇게 Bootstrap 5 스타일로 웹페이지를 보여줄 수 있게 됩니다
Bootstrap 5 공식 사이트는 getbootstrap.com 이라는 곳이고요 여기에 이제 다양하게 예시 같은 것도 있습니다.
이런 것들에서 마음에 드는 게 있으면 이 코드만 복사해서 사용을 하시면 되요.
그리고 cdnjs.cloudflare.com 이라는 사이트가 있는데 이렇게 bootstrap에 대해서 cdn버전이 있습니다.
이 중에 Bootstrap은 자바스크립트도 있구요 css가 있는데 우리가 자바스크립트 기능을 사용하진 않을 것이기 때문에 이 코드를 복사해서 사용을 한번 해 볼게요
템플릿 파일에서 이 css는 다 지우고요 지우고 자 링크 쓰시고 주소를 쓰십니다
여기에서 새로고침 해보시면은 이렇게 약간 뭔가 스타일이 입혀졌어요 입혀졌고 여기에서 우리가 이제 컨테이너 이렇게 쓰시면은 컨테이너로 한번 감싸주는 거죠
이렇게 한번 감싸주시고 클래스명에 fw-bold라고 주시면요 주시면 약간씩 스타일이 펴지고 있습니다 
컨테이너로 한번 감싸시면은 가운데 정렬이 된 레이아웃을 얻으실 수 있어요
그리고 볼드체를 적용을 해 주겠구요
다음에 폼 태그에다가 이제 클래스 명으로 MY4라는 건 뭐냐면 M이 마진이거든요
X는 좌우, Y는 상하입니다.
그래서 상하에 4만큼의 마진을 주겠습니다.
클래스 명으로 form-control 이라고 주시면, 새로 고침해보시면 이렇게 포토스트레이브로
스타일링이 입혀집니다.
그리고 테이블 태그는 이제 클래스로 table table-hover table-bordered 라고 주시면은
새로 고침해 보시면은 여기 약간 스타일이 펴졌고 호버드가 들어갔기 때문에 마우스 올리면은
마우스가 올라간 것을 이렇게 스타일이 따라가구요
보더드를 적용했기 때문에 외곽선이 추가가 되었습니다
자 이번에는 Tailwind CSS 프레임워크으로 스타일링을 해 보겠습니다
이 주소로 들어가 보시면은 이렇게 안내 페이지가 있구요
개발 환경에서 가장 간단하게 Tailwind CSS를 적용하는 것은 이 코드를 적용하는
것입니다 그래서 우리 사이트에도 한번 해보면요 적용해서 새로고침 해보면은 좀 스타일이
없어졌죠
bootstrap을 지어서 그렇구요
여기 mxauto 라고 해서 클래스명으로 여러 클래스를 지정할 수 있어요 띄어쓰기 썼으니까
두개가 지정된 겁니다
새로고침 해보시면 약간 중앙정렬이 되었죠
그리고 FW Bold는 Footstep 5의 클래스명이고, 텔빈드에서는 폰트 볼드 그리고
텍스트 2엑셀 이렇게 지정하시면 이렇게 스타일링이 입혀지고 있죠
폼 태그에서는 MI4는 똑같네요
폼 컨트롤이 아니라 WFULL P2 Border Rounded 그리고 포커스에는
Outline None 다음에 다시 포커스에서는 링이라고 해서 주시면 이렇게 스타일링이
입혀집니다 그리고 테이블 태그에서는 대그에서는 최소 W 가도 풀이고 비지 화이트 그리고
보더를 주면은 이제 1 픽셀 짜리 보더가 생기는데 보더 색깔은 100이라고 100 200
300 이라고 Tailwind에서 정의한 클래스 명이 있습니다
그 중에 100은 가장 연한 거고요
300은 세 단계로 연한 거죠
세 번째로 연한 거고 디바이드 Y 디바이드 구분선을 주는 건데 이제 300 이라고 줍니다
그래서 새로고침 해보면 스타일이 약간 입혀졌죠
그리고 tr 태그에서는 이제 클래스로 텍스트 센터를 주겠고요 첫번째 th 는 자
클래스명으로 py2 패딩인데 아래위로 패딩 이만큼 주고 px4 는 패딩인데 좌우로 주고요
border는 이제 보더 바텀에서 아래에만 보더를 주겠다가 되겠고 py2 px4 보더 b
라고 주시면은 이렇게 살짝 들어갑니다.
음.. 호버는 비지 그레이 200 이죠 주시면은 이렇게 호버 스타일이 들어가고 td 에서도
클래스명으로 py-2 px-4 그리고 py-2 px-4 라고 지정하시면은 이렇게 스타일링이 입혀졌죠
Bootstrap5는 이미 정의된 스타일을 빠르게 적용할 수 있고요, Tailwind
CSS는 유틸리티 CSS 프레임워크로써 작은 스타일을 조합해야 하기에 번거로움이 있지만
자유도가 높습니다.
UI 컴포넌트를 개발해서 재활용하는 개발 방식에서는 Tailwind CSS가 더 강점을
가집니다.