안녕하세요. 이번 시간에는 파이썬 3.12 버전을 Ubuntu Linux에 설치해
보겠습니다. 우리는 Ubuntu 22.04 버전을 사용하고 있습니다.
2022년 4월에 릴리즈된 배포판입니다.
Ubuntu 22.04 버전부터 Python 명령은 기본에서 지원하지 않고요.
Python 3 명령만을 지원합니다.
파이썬2와 파이썬3는 서로 호환되지 않기 때문에 리눅스에서는 파이썬 명령으로 파이썬2를
지원하고 있었고요.
파이썬3 명령으로 파이썬3를 구별하여 지원했었습니다.
파이썬2의 공식 지원이 2020년에 종료되었기에 리눅스에서 파이썬2 지원이 빠지게 되었고
파이썬 명령도 제거된 것입니다.
하지만 이는 OS의 기본 설정일 뿐 쉘 설정이나 가상 환경을 통해 파이썬 명령이 파이썬
3로 동작하도록 설정하실 수 있습니다.
AWS 라이트세일 22.04 LTS에 설치된 파이썬은 3.10 버전으로 확인됩니다.
파이썬 3.11 버전은 파이썬 10에 비해 약 1.25배 더 빠르다는 보고가 있습니다.
파이썬은 점점 더 빨라지고 있습니다.
기본 설치된 3.10 버전을 쓰셔도 되겠고요.
3.10 이후 버전에 파이썬을 설치하는 몇 가지 방법이 있습니다.
첫 번째 방법으로 파이썬 소스 코드를 직접 다운받아 컴파일해서 설치하는 방법입니다.
이 방법은 파이썬 소스 코드를 찾아서 다운받아서 컴파일 환경도 만들어야 하고 컴파일 시간도
오래 걸리지만 컴파일 옵션을 원하는 대로 지정할 수 있습니다.
하드코어한 방법이죠.
컴파일 시간은 라이트 세일 인스턴스 최소 사양 기준으로 30분 정도 걸립니다.
두 번째 방법으로 pyenv라는 파이썬 패키지 매니저를 활용하는 방법입니다.
이 방법 역시 파이썬 소스 코드를 다운받아서 컴파일하지만 컴파일 과정이 어느 정도
자동화되어 있기에 좀 더 수월하게 컴파일할 수 있습니다.
pyenv는 모든 파이썬 배포판을 지원하기에 cPython 외에 다양한 버전의
anaconda, pypy, Jython 등의 배포판 설치가 필요하시다면 좋은 선택입니다.
세 번째 방법으로 Ubuntu 비공식 저장소에서 미리 빌드된 파이썬 바이너리를 받아서
설치하는 방법입니다.
미리 빌드된 파이썬 바이너리를 설치하기에 설치 시간이 짧다는 장점이 있습니다.
우리는 이 세 번째 방법으로 파이썬 3.12를 설치해 보겠습니다.
Ubuntu 22.04 기본 저장소에서는 Python 3.10까지 지원합니다.
add-apt 레퍼지토리 명령으로 deadsnake 저장소를 추가하면 패키지 저장소
업데이트까지 수행되고요.
이제 Python 3.12 버전도 Ubuntu 패키지 매니저를 통해 손쉽고 빠르게 설치하실
수 있습니다.
apt install 명령으로 Python 3.12와 Python 3.12의 가상환경
패키지를 설치해 줍니다.
설치가 끝난 후에 파이썬 3.12가 시스템 경로인 유저 빈 경로에 잘 설치가 되어 있고요.
버전은 3.12.2 버전입니다.
마이크로 버전은 설치 시기에 따라 달라질 수 있습니다.
마이크로 버전은 주로 버그 수정, 보안 패치 등의 작은 업데이트를 나타냅니다.
마이크로 버전 간에는 이전 버전과의 호환성이 유지되며 새로운 기능이 도입되지 않기 때문에
3.12.3, 3.12.4 등의 버전이 설치되면 더 좋습니다.
파이썬 명령과 파이썬 3 명령, 파이썬 3.10 명령은 변경되지 않고 그대로입니다.
파이썬 3.10 버전은 Ubuntu 리눅스 시스템 내에서도 사용하는 파이썬이므로 삭제하지
않습니다. 이 서버에서는 이제 파이썬 3.12 명령만을 사용하겠습니다.
지금 설치한 3.12 버전에는 pip가 포함되어 있지 않으므로 getpip.py 코드를
다운받아 파이썬 3.12에 설치하도록 합니다.
이제 파이썬 3.12에서도 pip를 사용할 수 있습니다.
데드스네이크 비공개 저장소를 시스템에 추가합니다.
비공개 저장소가 추가되고 패키지 업데이트까지 자동으로 수행됩니다.
파이썬 3.12 이름의 패키지를 검색해 보시면 이제 다양한 파이썬 3.12 패키지가
검색됨을 확인하실 수 있습니다.
파이썬 3.12와 파이썬 3.12 가상환경 패키지를 설치합니다.
설치가 약 40초 정도 걸렸습니다.
미리 빌드된 Binary를 설치하기에 무척 빠르게 설치됩니다.
파이썬 3.12 명령이 확인되고요 파이썬 3 명령은 여전히 파이썬 3.10 버전을 가리키고
있고요 파이썬 명령은 없습니다
curl 명령을 통해 getpip.py 파일을 다운받아서 표준 출력으로 보낼 수 있고요 이
코드를 파이썬 3.12로 보내어 파이썬 3.12에 pip를 설치도록 합니다
이제 파이썬 3.12에서도 pip를 사용할 수 있습니다