안녕하세요. 이번 시간에는 장고 서비스 아키텍처에 대해서 간략히 살펴보겠습니다.
장고 서버는 윈도우, 맥, 리눅스 등의 운영체제에서 구동하실 수 있는데요.
장고를 포함한 오픈소스 기반의 웹 서비스 서버는 윈도우보다 리눅스를 통해 서비스하는 것이
일반적입니다.
왜냐하면 다양한 오픈소스 라이벌리와 서비스들이 리눅스를 가장 먼저 지원하며 가장 좋은
성능을 뽑아낼 수 있기 때문입니다.
아마존 웹 서비스에서 장고 웹 서비스를 구동하는 방법은 이와 같이 아주 다양합니다.
이중에 리눅스만 설치된 가상 머신 기반에서 필요한 패키지와 서버 설정을 직접 구성할 수
있는 서비스는 아마존 라이트 세일과 아마존 EC2 서비스입니다.
가상 머신을 직접 활용하는 방식은 배포가 번거롭지만 아마존 웹서비스 뿐만 아니라 다른
클라우드 서비스에서도 활용하실 수 있으며 가상 머신 세팅에 활용한 방법은 직접 물리적
서버에 서비스를 구축하실 때에도 활용하실 수 있습니다
EC2가 기능이 많지만 라이트 세일이 EC2에 비해 설정이 간단하며 비용이 저렴하므로
라이트 세일을 활용해 서비스 배포를 진행해 보겠습니다 장고 서비스를 라이트 세일 인프라에
배포하는 아키텍처는 이와 같이 구성해 보실 수 있습니다.
EC2를 활용한 아키텍처도 비슷하고요.
다른 클라우드 벤더를 사용하시더라도 비슷합니다.
아마존 라이트 세일 인스턴스는 자동으로 라이트 세일 계정 단위로 VPC 가상 네트워크를
생성해 줍니다.
VPC는 Virtual Private Network의 약자로써 격리된 가상의 사설
네트워크를 의미합니다.
보안을 위해 VPC 내에서 로드 밸런서만 외부로 노출하고, Django 서버와 데이터베이스
서버와 Redis 서버는 VPC 내에 숨겨둡니다.
Django 서버와 Redis 서버는 접속에서 필요한 설정을 해야 하기에 22번 포트를
열어두되 접속할 수 있는 IP는 제한시킵니다.
VPC 내에서 각 서비스는 각자의 사설 IP로 통신할 수 있습니다.
장고 가상 머신의 수평 확장, 즉 스케일 아웃 지원을 위해 노드 밸런서를 앞단에
위치시키고, HTTP, HTTPS 트래픽은 노드 밸런서를 경유해서 각 장고 가상 머신에
도달하도록 합니다.
로드밸런서는 화장실에서 한 줄 서기를 하는 것과 같습니다.
LightSail에서 로드밸런서 관리형 서비스를 지원함으로 이를 활용할 수 있습니다.
Django 가상머신은 LightSail 인스턴스 서비스로 생성하고, LightSail
인스턴스 서비스에서 여러 운영체제를 지원하는데요.
이중 Ubuntu, Linux 운영체제를 사용합니다.
장고 가상머신 내에서 장고 WSGI 서버는 Gunicorn을 활용해서 80번 포트로 서비스를
띄웁니다. 서비스 트래픽에 따라 장고 서버 대수를 수평적으로 늘리실 수도 있고요.
이 장고 서버는 관리 목적으로 22번 SSH 포트를 외부에 제한적으로 허용할 뿐,
HTTP, HTTPS 포트인 80번, 443번 포트는 외부에 허용하지 않습니다.
HTTP, HTTPS 트래픽은 로드밸런서를 통해서만 받도록 합니다.
그리고 데이터베이스 서버는 LightSail 데이터베이스 관리형 서비스인
PostgreSQL 데이터베이스를 활용합니다.
데이터베이스 서버는 외부의 포트를 공개하면 비밀번호를 걸어두더라도 누군가 비밀번호를 알면
접근할 수 있는 보안에 큰 위협이 되므로 외부로의 접근은 절대 허용하지 않습니다.
캐시 서버 목적으로서의 레디스 서버는 라이트 세일에서 관리형 서비스로 제공하지 않으므로
라이트 세일 인스턴스를 하나 생성해서 레디스 서버를 직접 구축하실 수 있습니다.
Django 에스테틱 미디어 파일은 라이트 세일 블록 스토리지를 활용해서 저장 및 서빙할
수 있습니다. 이 서비스는 아마존 웹 서비스의 S3 서비스와 유사하며 Django
스토리지스 라이브러리의 S3 설정을 활용해서 연동합니다.
앞선 아키텍처를 단순화해서 이와 같이 가상머신 하나를 생성해서 배포를 진행해 보겠습니다.
데이터베이스 서버는 라이트세일 PostgreSQL 관리형 데이터베이스를 사용하겠습니다.
Django 가상머신에는 Nginx 웹서버를 추가로 설치하여 HTTP, HTTPS 트래픽을
직접 받아 리버스 프록시 방식으로 Gunicorn Django 서비스로 트래픽을 전달합니다.
지유니콘 장고 서비스는 Unix 소켓 방식으로 띄우실 수도 있고 TCPIP 방식으로 띄우실
수도 있습니다.
도메인이 있으시다면 엔진엑스 웹서버에서 HTTPS 지원을 위해 Let’s Encrypt
연동을 통해 개인이나 소규모 사이트 운영자들이 별도의 비용 없이 SSL, TLS 인증서를
지원받으실 수 있습니다.
실 서비스에서는 서버를 2대 이상 운영하시는 것이 안정적이며 이때에는 로드 밸런서를
사용하시길 추천드리고요.
그러면 서버 하나가 죽더라도 다른 서버를 통해 장애 없이 서비스하실 수 있습니다.
static media 파일들은 로컬 파일 시스템에서 저장 및 서빙하도록 합니다.
이는 배포는 간단하지만 각 파일들이 백업 없이 로컬 파일 시스템에 저장되기에 유실의 위험이
있습니다. 서버를 한 대만 운영하시는 경우에도 라이트 세일 블록 스토리지나 아마존 웹
서비스의 S3 서비스를 활용하시는 것이 좋습니다.