Post 모델과 Comment 모델에는 Created At Field와
Updated At Field가 동일하게 정의되어 있습니다.
다른 모델 클래스에서도 Created At, Updated At Field가 필요할 때
코드를 그대로 복붙해서 정의해야 할까요?
모델 필드 외에도 동일한 메서드들이 여러 클래스에 걸쳐 정의될 수 있습니다.
이렇게 여러 모델 클래스에 걸쳐 반복되는 필드나 메서드가 있으면 추상화 모델 클래스 상속을
통해 반복을 제거하실 수 있습니다.
파이썬은 다중 상속을 지원하기 때문에 여러 추상화 모델 클래스를 상속 받으실 수도 있고요.
추상화 모델 클래스로 만들려면 메타의 abstract 설정을 참으로 설정해 주세요.
추상화 모델 클래스는 상속 전용 클래스가 되며, 마이그레이션 대상에서 제외되어 데이터베이스
테이블을 생성하지 않습니다.
추상화 모델 클래스에 반복되는 모델 필드와 메서드를 정의하고, 포스트 모델과 코멘트
모델에서는 상속만 받으면 됩니다.
이제 포스트와 코멘트 모델은 추상화 모델 클래스에 정의된 Created At 필드와
Updated At 필드 정의를 가지게 됩니다.
코드 중복을 줄이면서도 모델들은 이전과 동일하게 동작합니다.
블로그 앱의 모델 스파이에 이렇게 코멘트 모델을 새롭게 추가를 했고요 Post 모델의
CreatedAtField 그리고 UpdatedAtField가 코멘트 모델에도 필요해서
그대로 복사해서 붙여넣었습니다
AccessLog 모델 클래스, Article 모델 클래스, Review 모델 클래스에도
필요해서 이렇게 복붙을 했습니다 생성 시각과 수정 시각은 거의 모든 모델에 필요할 수가
있죠. 이렇게 같은 모델 필드 혹은 같은 모델 메서드가 여러 모델 클래스에 반복적으로
필요할 수가 있습니다.
그때마다 코드를 이렇게 복불해서 쓰기보다 새로운 모델 클래스를 생성을 해주고요.
이 모델 클래스에 반복되는 모델 필드나 혹은 모델 메서드를 적용을 해 두시고 이 모델
클래스 단독으로 사용할 것이 아니라 상속을 목적으로 사용할 것이기 때문에 클래스 메타에서
Abstract 설정을 참으로 지정을 하겠습니다
CreatedField 그리고 UpdatedField가 필요한 모델에서는
TimeStamped 모델이라는 클래스를 상속만 받으시면 됩니다
이렇게 Post 모델에서도 TimeStamped 모델의 상속을 받으면 반복되는 필드 정의나
반복되는 메서드 정의를 이렇게 줄이실 수 있습니다
Comment 모델에서도 AccessLog도 Article 모델에서도 이렇게 상속을 받고
Review에서도 상속을 받는데 파이썬 클래스는 다중 상속을 지원하기 때문에 이렇게 여러
추상화 모델 클래스를 상속을 받는 형태로 구현을 하실 수 있겠고요 Make
Migrations Blog 명령을 통해 마이그레이션 파일을 생성을 하는데 Auto Now
Add 참이 지정된 Created의 필드에 한해서만 디폴트 값을 요구하고 있습니다
일회성 디폴트 값을 적용하기 위해서 1번을 선택하겠고요 데이터 타임 필드이기 때문에 추가
안내 메세지가 나오네요.
timeZone.now라는 값을 입력을 하려면 그냥 엔터 키만 입력을 해도 된다라고 디폴트
값이 자동으로 제시가 되고 있죠.
timeZone.now 하셔도 되고 그냥 엔터 치겠습니다.
그리고 Created it 필드가 또 물어보죠.
1번 엔터, 1번 엔터, 엔터.
AccessLog에 대해서 CreatedAppField, ArticleReview라는 모델
클래스에 대해서도 이렇게 적용이 되겠고요 새롭게 생성된 11번 마이그레이션 파일을
열어보시면 이렇게 AccessLog에 대해서 Article 모델에 대해서 리뷰에 대해서
이렇게 추가가 되고 있음을 확인하실 수 있겠고요 그리고 Comment 모델에 대해서도
새로운 데이터베이스 테이블이 생성이 될 때에도 CreatedAppField와
UpdatedAppField가 추가가 됨을 확인하실 수 있습니다
파이썬 manage.py, SQL Migrate 블로그의 0011 명령으로 SQL 내역을
살펴보시면 블로그의 Access Log 데이터베이스 테이블에 Created의 컬럼이 추가가
될 때에 디폴트 값으로 현재 시각이 자동으로 이렇게 입력이 되겠고요 Updated 필드의
경우에는 따로 디폴트 값을 지정하지 않았지만 이렇게 현재 시각이 자동으로 지정이 됨을
확인을 하실 수 있습니다
파이썬 매니지파이 마이그레이트 블로그 명령을 통해서 이렇게 데이터베이스에 적용을 했고요
파이참의 데이터베이스 패널에서 새로고침을 한번 하시면 블로그에 Comment
Database 테이블도 생성이 되었고 Created at, Updated at 컬럼도
추가가 되었으며 타임 스탬프드 모델 클래스를 상속받은 다른 모델의 테이블에서도
Created at 컬럼과 Updated at 컬럼이 마이그레이트를 수행한 시각으로 컬럼이
추가되었음을 확인하실 수 있습니다