데이트 인풋 위젯을 통해 날짜를 입력받을 때에는 유저가 연,월,일 포맷으로 직접 입력을
해야 하는데요
데이트 피커 인풋 위젯을 통해 자바스크립트로 달력을 띄워서 유저가 달력 클릭만으로 날짜가
입력될 수 있도록 위젯을 구성해 보겠습니다
데이트 인풋 클래스를 상속받은 데이트 피커 인풋 클래스를 정의하고요 커스텀 템플릿을 사용할
것이고 외부 CSS, 자바스크립트 의존으로 바닐라 자바스크립트 데이트 피커 라이브러리를
지정하겠습니다
Bootstrap5 기반의 CSS를 지정했고요.
이외에도 Bootstrap4, 불마, 파운데이션 CSS 프레임워크를 지원합니다.
커스텀 템플릿에서는 데이트 인풋 위젯의 기본 템플릿을 인클루드하고요.
템플릿 단에서 자바스크립트로 인풋 요소의 속성들을 이렇게 추가하실 수도 있습니다.
자동 완성도 끄고 직접 편집할 수 없도록 읽기 전용 모드도 설정합니다.
달력을 통해서만 값이 입력되도록 합니다.
이어서 자바스크립트 인풋 요소에 Vanilla.js 데이트 피커 라이브러리을 통해 달력을
적용합니다. 기본 날짜 포맷으로 4자리 연도, 2자리 월, 2자리 일을 지정하고 데이트
피커 API 호출만으로 이렇게 DatePickerInput 위젯을 구현하실 수 있습니다.
그런데 달력이 영어로 표시되는데요.
한국어를 지원하려면 슬라이드 하단에 안내된 공식 문서를 참고하여 한국어 번역을 제공하시면
한국어로 달력을 사용하실 수 있습니다.
accounts의 프로필 모델에 Birth Date, Date Field 모델 필드를
추가해 주겠습니다.
옵션 필드로 지정하기 위해 Blank 옵션과 Null 옵션을 참으로 지정했습니다.
blank 옵션은 관련 폰필드에서 빈 값 상태를 허용하겠다는 의미이며 null 옵션은
데이터베이스 클럼에서 null을 허용하겠다는 의미입니다.
문자열 컬럼이면 blank true만 지정해서 빈 문자열로 지정하겠지만 문자열 클럼이 아닌
데이트 클럼이기에 빈 문자열로 값을 저장할 수가 없어요.
비어있는 값은 null로 지정합니다.
마이그레이션 수행해주고요.
프로필 폼, 모델 폼에도 BirthDate 필드를 추가하고 프로필 수정 폼을 띄워보면
이렇게 생일 입력받는 필드가 뜹니다.
그럼 유저는 DateField 필드가 지원하는 포맷으로 년, 월, 일을 타이핑해서 입력을
해야겠죠. 이제 DatePickerInput 위젯을 구현해 봅시다.
DateField 모델 필드의 클래스 코드에서 FormField 메서드을 보시면 모델
폼 필드 생성 시에 DateField 폼 필드가 사용됨을 확인하실 수 있습니다.
데이트 필드 폼필드에서는 디폴트 위젯으로 DateInput이 지정되어 있네요.
데이트 인풋 위젯 클래스를 상속받은 DatePickerInput 클래스를 정의합니다.
커스텀 템플릿 경로를 지정하고 생성해 줍니다.
데이트 인풋 위젯 클래스의 템플릿 경로도 복사해서 include 해 주고요.
이제 추가로 자바스크립트만 구현해 주면 되겠죠
프로필 폼 모델 폼에서 Verse Date 모델 필드에 대한 위젯을 DatePicker
Input 위젯으로 변경해 주고요 프로필 수정 폼 페이지를 새로 고침하시면 종전과 동일하게
보여집니다 데이트 피커 인풋 위젯에 Vanilla.js DatePicker 라이브러리에 CDN
주소를 추가해 줄 텐데요.
물론 다운받아 스태틱 경로에 복사해서 안정적으로 적용하셔도 됩니다.
구글을 통해 해당 CDN 주소를 검색해 봅시다.
구글에서 CDN Vanilla.js 데이트 피커 키워드로 검색해 보니
jsdelivery.com 사이트가 검색이 되네요.
이 페이지에서 브라우저 CDN 페이지로 들어갑니다.
dist 폴더의 css 폴더에서 DatePicker BS5.min.css 파일의 링크를 따서 데이터
피커 인풋 위젯의 미디어 설정의 css 경로로 적용하고요.
dist 폴더의 js 폴더에서 DatePicker BS5.min.js 파일의 링크를 따서 js 경로로
적용합니다.
템플릿에서는 form.media 속성을 렌더링해야 미디어 속성에 지정한 css 파일,
javascript 파일에 대한 태그가 자동으로 생성이 되죠
절대 빼먹으시면 안 돼요
페이지 소스보기 하면 css, javascript 태그가 지정한 대로 잘 생성이 되어
있습니다 이제 DatePicker Input 위젯에 javascript 코드로 달력을 추가해
주겠습니다
script 요소에 직전 인풋 요소를 조회하고요 템플릿에서 인풋 요소에 브라우저 자동완성
끄기 옵션과 읽기 전용 옵션을 지정해 주겠습니다
위젯 클래스에서 지정해서 HTML로 속성을 지정하셔도 되고 템플릿 단에서 이렇게
자바스크립트를 통해 속성을 지정하실 수도 있습니다.
페이지 새로 고침하시고 브라우저 개발자 도구를 확인해 보시면 Read Only 속성과
Autocomplete 속성이 잘 지정되어 있네요.
달력 옵션으로 년, 월, 일 입력 포맷을 지정하고요.
데이터 피커를 적용하고 웹 페이지를 새로 고침합니다.
입력 필드를 클릭해 보면 어?
달력이 안 뜨네요
이럴 때 무조건 웹브라우저 개발자 도구의 콘솔 탭을 띄웁니다
자바스크립트 개발에서는 무조건 웹브라우저 콘솔 탭을 계속 띄워놓고 체크해야 됩니다
자바스크립트 오류가 발생하면 여기에 오류가 표시됩니다.
오류를 보니 DatePicker를 찾을 수 없다고 하네요.
오타네요. DatePicker의 P가 대문자가 아니라 소문자 P입니다.
수정하시고 새로고침하시고 해당 필드를 클릭하시면 이렇게 달력이 표시되고 클릭한 날짜로
필드의 값이 입력됨을 확인하실 수 있습니다.
Read Only 설정이 지정되어 있어 유저가 타이핑으로 날짜를 입력하실 수는 없어요.