안녕하세요. 이번 시간에는 폰필드 위젯을 변경하는 방법에 대해서 살펴보겠습니다.
커스텀 위젯 구현은 다음 강의에서 다루겠습니다.
위젯은 유저의 UI만을 처리합니다.
위젯 변경과 폰필드의 유효성 검사는 무관합니다.
바뀐 위젯이 서버로 전송되는 값이나 포맷을 변경해서는 안 됩니다.
위도경도를 입력받는 폼필드가 있습니다.
유저에게 위도경도 값 타이핑 입력을 요구하는 것은 너무 무리한 요구입니다.
원하는 위치의 위도경도 값을 알아내는 것도 어렵고 오타로 인해 엉뚱한 위치로 입력될 수도
있습니다. 커스텀 지도 위젯, 네이버 맵 포인트 인풋 위젯을 만들어서 폼필드의 위젯 인자로
지정하여 위젯을 변경할 수 있습니다.
위젯 클래스를 지정하셔도 되고, 위젯 인스턴스를 지정하셔도 됩니다.
위젯 클래스를 지정하면 위젯 사용 시에 인스턴스가 자동 생성됩니다.
이제 유저는 위도 경도 위치를 지도를 클릭하는 것만으로 자바스크립트를 통해 위도 경도를
자동 입력할 수 있게 되었습니다.
지도에서 검색을 지원해 주면 간단히 검색만으로도 원하는 위치에 위도 경도를 손쉽게 입력할
수 있게 됩니다.
위젯 변경을 통해 UI만 변경되었을 뿐 서버로 전송되는 값은 위도, 경도, 포맷은
동일합니다. 커스텀 위젯 구현은 기본 인풋 요소 뒤에 지도 구성이 필요한 HTML과
JavaScript를 추가하는 것으로 손쉽게 구현하실 수 있습니다.
불리한 필드 폰필드는 체크박스로 렌더링 되지만 iOS 스타일의 스위치 커스텀 위젯으로
이렇게 변경해 보실 수 있고요.
Choice Field 폰필드는 Select 위젯으로 렌더링 되지만 단일 선택이 있기에
Radio Select 위젯으로 변경이 가능합니다.
멀티풀 초이스 필드 폼필드는 셀렉트 멀티풀 위젯으로 렌더링 되지만, 다중 선택되기에
체크박스 셀렉트 멀티풀 위젯으로 변경이 가능합니다.
캐릭터 필드 폼필드는 단순히 인풋 타입 텍스트 요소로 한 줄 입력을 받지만, 카운터 텍스트
인풋 커스텀 위젯으로 글자 수를 아래에 보여줄 수 있습니다.
그리고 여러 줄 입력이 필요할 때에는 텍스트 에어리어 위젯을 활용합니다.
인티저 필드 폼필드는 디폴트로 인풋 타입 넘버 요소로 렌더링 되고요 1부터 5 범위의 값
입력을 받기 위해 숫자 입력을 바로 받을 수도 있겠지만 선택지가 정해진 상황에서는
ChoiceField 폼필드를 사용하실 수 있고 ChoiceField 폼필드는 값을
문자열로만 반환하니 HiddenInput를 사용하시고 코어스 인자를 사용해서
정수로 변환된 값을 제공 받으실 수 있습니다
데이트 필드 폼필드는 단순히 인풋 타입 텍스트 요소로 한 줄 입력을 받지만, SelectDate
위젯 을 지정하시면, 연, 월, 일을 별도 셀렉트 요소로 분류해서 입력 받으실 수
있습니다. 모델 폼에서는 각 모델 필드의 폼필드 메서드에 등록된 사전 타입의 폼필드 메타
정보를 읽어드려 폼필드를 자동으로 구성합니다.
모델 폼에서 위젯을 변경하는 첫 번째 방법은 폼 필드를 직접 추가하는 방법인데요.
모델 필드와 같은 이름의 폼 필드를 추가하면 자동 생성된 폼 필드를 덮어쓰게 됩니다.
그러면 모델 내역에 맞춰 min-value, max-value, label,
help-text 등의 각종 필드 정보를 맞춰줘야 하는 번거로움이 있기에 비추천입니다.
두 번째 방법은 메타 클래스의 widgets 사전에 각 필드별 Widget을 지정해서 모델
폼에서 Widget만 변경하도록 간결하게 지정하실 수 있습니다.
추천드리는 방법이고요.
세 번째 방법은 모델 폼 클래스의 생성자를 재정의해서 생성된 폼필드 인스턴스의 Widget
속성을 변경하는 방법입니다.
코드를 통해 속성을 변경하는 방법이기에 가장 유연한 방법이고요.
반드시 Widget 클래스가 아닌 Widget 인스턴스를 생성해서 지정해 주셔야 합니다.
모델 어드민에서도 위젯을 변경할 수 있습니다.
모델 어드민에서는 내부에서 모델 폼 클래스를 자동으로 생성합니다.
내부에서 자동 생성된 폼 클래스를 사용할 경우 폼필드 오브라이즈 설정을 통해 모델 필드
타입별로 폼필드 인자를 일괄 지정하실 수 있고요.
이때 위젯 설정으로 위젯을 일괄 변경하실 수 있습니다.
개별 필드 단위의 변경은 지원되지 않습니다.
Hook은 직접 모델 폼 클래스를 따로 구현하여 이때 필요한 위젯을 변경하고 그 폼
클래스를 폼 설정으로 지정하는 방법이 있습니다.