장고에서는 다양한 이메일 백엔드를 기본에서 지원하는데요.
이메일 발송 시에 콘솔 설정은 개발 서버 콘솔에만 이메일 발송 내역을 출력하고요.
SMTP 설정은 SMTP 프로토콜을 지원하는 이메일 서버에 접속해서 이메일을 실제
발송합니다.
샌드메일 함수를 호출하면 세팅스의 이메일 백엔드 설정에 지정된 방법으로 이메일을
발송합니다. 세팅스 설정에서 디버그 값이 참인 개발 환경에서는 이메일을 발송하지 않고
콘솔에만 출력하도록 하겠고요.
디버그 값이 거짓인 서비스 환경에서는 SMTP를 통해 이메일을 발송하겠습니다.
다양한 메일 서비스가 있겠지만 많은 분들이 가지고 계신 네이버 메일과 구글 메일에서도
SMTP 프로토콜을 지원하거든요.
하지만 이는 개인 이메일 서비스이므로 발송량에 제한이 있습니다
서비스에서 안정적인 대량의 메일 발송을 하려면 아마존 심플 이메일 서비스와 같은 전문적인
이메일 발송 서비스를 사용하시기를 추천드립니다
SMTP 설정은 메일 서비스마다 요구하는 설정이 다르기 때문에 해당 메일 서비스에서
SMTP 옵션을 꼭 켜주셔야 하고요.
네이버 메일 서비스에서는 SMTP 옵션이 디폴트로 꺼져 있거든요.
켜주셔야 하고요.
이메일 호스트 유저 설정에는 네이버 메일 주소에 아이디를 입력하시는데요.
골뱅이네이버닷컴을 붙이셔도 되고 빼셔도 됩니다.
네이버 계정에 2단계 인증을 설정하신 경우 네이버 계정 로그인 암호를 지정하시면 안 되고요
네이버의 2단계 인증 페이지에서 애플리케이션 비밀번호를 생성하셔서 이메일 호스트 패스워드
설정으로 지정해 주셔야 합니다
구글 Gmail의 경우에도 2단계 인증을 걸어 두셨다면 구글 로그인 암호를 지정하시면 안 되고
2단계 인증 페이지에서 앱 비밀번호를를 생성하셔 이메일 호스트 패스워드 설정에 지정해 주셔야
합니다 앱 비밀번호에서 띄어쓰기가 있는데요 띄어쓰기를 넣으셔도 되고 빼셔도 됩니다.
그리고 이메일 호스트 유저 설정에 골뱅이 gmail.com을 붙이셔도 되고 빼셔도 됩니다.
네이버 메일에서 좌측 환경 설정 메뉴에 들어가시면 POP IMAP 설정 탭에서 POP3
SMTP 사용 옵션을 사용함으로 해주시고요.
아래 필요한 설정은 원하시는 대로 하시고 PD 저장 버튼을 클릭해주세요.
저장하지 않으시면 SMTP가 활성화되지 않습니다.
그리고 그 아래에서 SMTP 관련 설정을 확인하실 수 있습니다.
django.conf.global_settings 파일에서 Django 기본 세팅스
설정을 확인하실 수 있는데요.
이메일 백엔드는 이렇게 디폴트로 SMTP 백엔드가 지정되어 있고, 로컬 호스트의 메일
서버를 사용하도록 디폴트 설정되어 있습니다.
우리 설정에서 이메일 백엔드 설정을 변경해 보겠습니다.
이메일 백엔드로 콘솔 백엔드를 지정하고 동작을 확인해 봅니다.
장고 쉘을 다시 구동하시고요.
샌드메일 함수를 임포트하시고 샌드메일 함수를 호출하여 이메일 발송을 요청해 보겠습니다.
이메일 백엔드로 콘솔 백엔드를 지정했기에 실제로 메일이 발송되는 것은 아니고요.
이렇게 화면에 이메일 내역이 출력되고 발송 건수가 반환됩니다.
이번에는 SMTP 백엔드로 변경해 보겠습니다.
SMTP 백엔드 사용을 위해서는 이메일 호스트, 포트 등의 여러 계정 정보 설정이
필요합니다. 이들과 구글메일은 포트와 SSL, TLS 옵션이 다르니 주의해 주세요
DEBUG=True 구동에서는 개발 환경으로 보고 콘솔 백엔드로 동작토록 하고요 디버그 거짓
구동에서는 서비스 환경으로 보고 SMTP 백엔드를 사용하도록 이렇게 설정해 보실 수
있습니다 계정 정보를 소스 코드에 절대 하드코딩 해서는 안 됩니다
환경 변수를 통해 주의 받으셔야 하고요
각 설정 명에 맞춰 환경 변수 값을 찾아 설정토록 하겠습니다 장고
인바이런먼트 라이브러리로 각 환경 변수 값을 참조했는데요.
값 참조 시에 디폴트 값을 지정하지 않았기에 미설정 오류가 발생할 수 있습니다.
미설정 오류가 발생하면 오류 내역을 화면에 출력하고 콘솔 백엔드로 동작토록 변경해
주겠습니다. 디버그 환경 개발 환경에서도 SMTP 백엔드 사용이 필요할 수도 있으니깐요.
환경 변수에 이메일 호스트 값이 있으면 개발 환경이더라도 SMTP 백엔드를 시도해 보도록
설정하겠습니다.
장고 프로젝트의 환경 면수를 주입하는 방법은 장고 서버를 구동하는 운영 체제와 구동 방법에
따라 다양한 방법이 있을 수 있습니다.
현재 개발 환경에서는 .env 파일을 통한 로딩이 설정되어 있으니
.env 파일에 SMTP 계정 정보 환경 변수를 설정해 주겠습니다.
SSL, TLS 옵션은 SMTP 서버에 따라 설정이 다르니까 설정을 간소화하기 위해
디폴트로 거짓으로 설정도 추가해 주겠습니다.
여러분의 SMTP 계정 정보를 설정해 주시고요.
저는 네이버 메일 계정 정보로 설정을 합니다.
네이버 메일에서 아직 SMTP 활성화를 하지 않으신 분은 지금 활성화해 주세요.
활성화하지 않으면 모든 계정 정보를 맞게 지정하셨더라도 SMTP 인증 오류가 발생합니다.
저는 네이버 계정에 2단계 인증을 설정해 둔 상태입니다.
2단계 인증을 걸지 않으신 분은 .env 파일의 비밀번호 설정에 네이버 비밀번호를 그대로
쓰시면 되고요 저처럼 2단계 인증을 걸어두신 분은 이렇게 네이버 아이디 페이지에 방문하셔서
2단계 인증 페이지를 통해서 애플리케이션 전용 비밀번호를 생성해 주세요
애플리케이션 종류를 기입하시고 비밀번호 생성 버튼을 클릭하시면 비밀번호가 출력됩니다
이 비밀번호를 .env 파일에 기입해 주시면 됩니다.
이 비밀번호는 녹화 후에 삭제된 비밀번호이므로 이 비밀번호를 쓰셔도 동작하지 않습니다.
새롭게 잔고셀을 여셔서
.env 파일을 다시 로딩하시고요.
.env 파일이 제대로 로딩이 되어 있는지 확인을 위해 세팅스의 각 설정을 하나하나 확인해
주세요. .env 파일에 기입된 내용만 보시고 당연히 잘 로딩이 되었겠지 라고 생각하셔서는
절대 안 됩니다.
최종 반영된 값을 확인하셔야 되는 거예요.
세팅스의 이메일 호스트, 포트, 유저명, 암호, SSL, TLS 옵션들을 꼭 확인해
주세요. 그리고 샌드메일 함수를 통해 이메일 발송을 확인해 보세요.
FROM 이메일 인자에는 여러분의 네이버 이메일 주소를 써 주셔야 합니다.
다른 이메일 주소를 쓰시면 이메일 발송 요청이 거부돼요.
오류 없이 이를 반환받으면 이메일 발송에 성공한 것입니다.
방금 발송한 이메일을 저는 이렇게 받았습니다.
이와 같이 SMTP 인증 오류가 발생하신다면 SMTP 계정 설정이 잘못 지정되어 있거나
네이버 메일에서 SMTP를 활성화하지 않으셨을 겁니다.
차근차근 확인해 보세요.