생성 모델 폼 구현과 수정 모델 폼 구현이 비슷하듯이 생성 API 구현과 수정 API
구현도 비슷합니다.
수정 모델 폼 구현에서는 수정 대상 레코드를 조회하고 모델 폼 인스턴스 생성 시에 인스턴스
이름의 키워드 인자로 넘겨주면 구현 끝이었죠.
그리고 form.SaveMethod 호출 시에는 포스팅을 생성할 때 이미 작성자 필드가
지정되어 있으니 추가 필드 지정이 필요 없었으니깐요.
커밋 인자 지정 없이 데이터베이스에 저장했었습니다.
수정 API 구현 시에도 수정 대상 레코드를 조회합니다.
그리고 Serializer 인스턴스 생성 시에 instance 이름의 키워드 인자로
넘겨줍니다.
이때에도 포스팅 생성할 때 이미 작성자 필드가 지정되어 있으니 추가 필드 지정이 필요
없으니깐요.
Serializer.save 호출 시에 추가 인자를 지정하지 않고 데이터베이스에
저장합니다. API 뷰에서 수정할 레코드를 조회하고 해당 레코드를 수정할 권한이 있는지
확인하는 로직이 있습니다.
지정 API를 실행할 권한이 있는지 확인할 때에는 Permission 클래스에
HasPermission 메서드를 호출하여 확인하고요.
지정 모델 인스턴스를 수정할 권한이 있는지 확인할 때에는
HasObjectPermission 메서드를 호출하여 확인합니다.
우리가 직접 구현한 PostEdit API를 Django REST Framework에 Update
API View 클래스를 상속받아 클래스 기반 뷰로 구현하신다면 이렇게 구현하실 수
있습니다 Update API View 클래스를 상속받았기에 요청과 패치 요청을 지원합니다.
푼 요청을 받으면 업데이트 메서드를 호출하여 수정 요청을 처리하고요.
푼 요청은 리소스의 전체 수정을 의미하기에 수정 요청 시에 반드시 시리얼라이저에 지정된
모든 필드 값을 전달해 주셔야 요청이 처리됩니다.
패치 요청에서는 파셜 업데이트 메서드를 호출하여 수정 요청을 처리합니다.
패치 요청은 리소스의 부분 수정을 의미하기에 수정 요청 시에 수정할 필드만 지정하셔도
요청이 처리됩니다.
PostCreateAPIView 클래스 코드를 복사해서 PostUpdateAPIView
클래스를 정의해 보겠습니다 상속받은 클래스명과 클래스명, 그리고 생성된 함수명도 바꿔줍니다
업데이트 API 뷰 클래스 코드를 보시면 put 요청에서는 업데이트 메서드를 호출하여
요청을 처리하고요.
패치 요청에서는 partial update 메서드를 호출하여 요청을 처리합니다.
업데이트 메서드 코드를 보시면 관련 내 코드 조회하고 시리얼라이저를 통해 유효성 검사
수행하고요. 유효성 검사에 통과하면 perform update 메서드를 호출하여
데이터베이스에 반영합니다.
perform_update 메서드의 기본 구현에서는 serializer 인스턴스의 save
메서드만 호출합니다 데이터베이스 저장 시에 serializer에 지정된 필드 외에 추가로
저장할 필드는 없으니깐요
performUpdate 메서드를 재정의할 필요는 없겠네요
복사한 코드의 perform_create 메서드는 제거합니다
현재 아이디가 101번인 포스팅이 있고요.
제목은 샘플 제목입니다.
아이디 101번 포스팅에 대해서 수정 요청을 보내보면 500 에러가 발생했습니다.
런 서버 로그를 보시면 PostUpdate API 뷰에 코디셋 설정이 누락되었다고 합니다.
PostCreate API 뷰에서는 레코드 조회 없이 생성만 하니깐요.
코디셋 설정이 필요하지 않은 것이 없고요.
PostUpdate API 뷰에서는 레코드 조회가 필요하니깐 코디셋 설정을 요구하고
있습니다.
PostSerializer의 get_optimized_codiset 정적 메서드로 기본
코디셋을 생성하고 PostUpdateAPIView 클래스의 코디셋 설정에도 추가해줍니다
API 수정 요청을 해보시면 200 응답을 받았고요 ID 101번 포스팅을 조회해 보시면
이처럼 수정된 내역을 확인하실 수 있습니다
푼 요청이니까 Serializer에 지정된 Title 필드와 Content 필드를 모두
지정해야만 하는데요
컨텐츠 필드를 빼고 요청하면 이처럼 유효성 검사에 실패합니다.
그런데 패치 요청에서는 변경된 필드만 보내셔도 이처럼 요청이 처리됩니다.