안녕하세요. 이번 시간에는 시리얼라이저를 통한 값 변환 및 Django REST
프레임워크에서의 재사용 직렬화에 대해서 살펴보겠습니다.
시리얼라이저를 통한 값 변환은 파이썬 기본 데이터 타입으로의 변환일 뿐, 재손 직렬화 등을
직접 수행하진 않습니다.
응답 데이터만 파이썬 기본 데이터 타입으로 준비해 줄 뿐입니다.
장고 REST 프레임워크의 시리얼라이저에서는 인스턴스 인자로 코디셋이나 모델 인스턴스를
지정받고 나서 시리얼라이저 인스턴스의 데이터 속성에 접근하면 인자의 코디셋이나 모델
인스턴스를 파이썬 리스트 타입이나 사전 타입으로 변환해 줍니다.
이때 이 변환은 시리얼라이저의 to_underbar_representation 메서드를
호출하여 변환을 처리합니다.
Serializer에서는 모델 인스턴스를 받아 사전 타입으로 변환해 주고요.
ListSerializer 클래스가 따로 있습니다.
Serializer 인스턴스 생성 시에 Many 키워드 인자로 참을 지정하시면 해당
Serializer 데이터 변환 시에 ListSerializer로 랩핑하여 변환된 데이터는
리스트가 됩니다.
Django REST 프레임워크에서는 JSON 렌더러를 통해서 JSON 직렬화를 수행합니다.
Django 기본에서도 Python 기본의 JSON Encoder를 확장한 Django
JSON Encoder 클래스를 지원하는데요.
Django REST 프레임워크에서는 Django JSON Encoder보다 훨씬 더 많은
타입을 지원하는 JSON Encoder를 지원합니다.
이 JSON Encoder는 JSON 렌더러의 Default Encoder
클래스 속성으로 지정되어 사용됩니다.


이 글에서는 **Django REST Framework (DRF)**에서의 시리얼라이저를 통한 값 변환과 재사용 가능한 직렬화에 대해 설명합니다. 주로 모델 인스턴스를 파이썬 기본 데이터 타입(리스트, 딕셔너리 등)으로 변환하는 과정과 DRF의 JSON 렌더러를 통한 직렬화 과정에 대해 다룹니다.

1. 시리얼라이저를 통한 값 변환
시리얼라이저는 모델 인스턴스나 쿼리셋을 받아 파이썬 기본 데이터 타입으로 변환하는 역할을 합니다. 변환된 데이터는 딕셔너리나 리스트 형식으로 제공됩니다.
예를 들어, 시리얼라이저의 to_representation() 메서드는 모델 인스턴스를 받아 파이썬 사전(dictionary) 형식으로 변환합니다.
2. 시리얼라이저의 to_representation() 메서드
to_representation() 메서드는 모델 인스턴스를 파이썬의 기본 데이터 타입(리스트나 딕셔너리)으로 변환하는 핵심 메서드입니다.
모델 인스턴스를 딕셔너리 형태로 직렬화할 때 사용됩니다.
시리얼라이저가 이 메서드를 호출하여 변환을 처리합니다.
3. ListSerializer
시리얼라이저에서 여러 객체를 처리할 때는 ListSerializer 클래스를 사용합니다.
Many 키워드를 사용하여 다수의 객체를 처리할 때 ListSerializer로 랩핑하여 리스트 형식으로 반환합니다.
예를 들어, Many=True로 시리얼라이저를 생성하면, 여러 객체를 리스트 형태로 직렬화합니다.
4. JSON 렌더러와 직렬화
DRF는 JSON 렌더러를 통해 JSON 직렬화를 수행합니다.
DRF에서 사용되는 JSON 직렬화는 Django 기본 JSON Encoder를 확장한 DRF의 JSON Encoder를 사용합니다.
기본 Django에서 제공하는 JSON Encoder는 제한적인 타입만 직렬화할 수 있지만, Django REST Framework의 JSON Encoder는 훨씬 더 많은 타입을 지원합니다.
이 JSON Encoder는 **Default Encoder**로 설정되어 JSON 렌더러에서 사용됩니다.
결론
DRF의 시리얼라이저는 모델 인스턴스나 쿼리셋을 받아 이를 파이썬 기본 데이터 타입으로 변환하는 역할을 합니다.
변환 과정은 to_representation() 메서드를 통해 이루어지며, 여러 객체를 직렬화할 때는 ListSerializer를 사용합니다.
JSON 렌더러는 DRF의 JSON Encoder를 사용하여 더 다양한 데이터 타입을 JSON 형식으로 직렬화합니다.